[
    {
        "key": "paper5",
        "paperName": "How Do We Measure Trust in Visual Data Communication?",
        "img": "/measuring_trust_teaser.png",
        "altText": "An icon of a person holding money in the middle left of the image labeled trustor. Two arrows pointing from the trustor to the top right and bottom right of the image. An icon of a person labeled Trustee 1 in the top right. An icon of a person labeled Trustee 2 in the bottom right.",
        "authors": "Hamza Elhamdadi, Aimen Gaba, Yea-Seul Kim, Cindy Xiong",
        "abstract": "Trust is fundamental to effective visual data communication between the visualization designer and the reader. Although personal experience and preference influence readers’ trust in visualizations, visualization designers can leverage design techniques to create visualizations that evoke a “calibrated trust,” at which readers arrive after critically evaluating the information presented. To systematically un- derstand what drives readers to engage in “calibrated trust,” we must first equip ourselves with reliable and valid methods for measuring trust. Computer science and data visualization researchers have not yet reached a consensus on a trust definition or metric, which are essential to building a comprehensive trust model in human- data interaction. On the other hand, social scientists and behavioral economists have developed and perfected metrics that can measure generalized and interpersonal trust, which the visualization community can reference, modify, and adapt for our needs. In this paper, we gather existing methods for evaluating trust from other disciplines and discuss how we might use them to measure, define, and model trust in data visualization research. Specifically, we discuss quan- titative surveys from social sciences, trust games from behavioral economics, measuring trust through measuring belief updating, and measuring trust through perceptual methods. We assess the potential issues with these methods and consider how we can systematically apply them to visualization research.",
        "venue": "IEEE BELIV, 2022",
        "link": "https://arxiv.org/pdf/2209.14276.pdf",
        "tagType": "workshop-tag"
    },
    {
        "key": "paper4",
        "paperName": "Using Processing Fluency as a Metric of Trust in Scatterplot Visualizations",
        "img": "/tweet_visual_content.png",
        "altText": "Seven scatterplots in a row. From left to right, the scatterplots are labeled Blur, Opacity, Outline, Gridlines, Scale, Overlap, and Control. Each scatterplot shows a different dataset camouflaged by the type of camouflage in its label.",
        "authors": "Hamza Elhamdadi, Lace Padilla, Cindy Xiong",
        "abstract": "Establishing trust with readers is an important first step in visual data communication. But what makes a visualization trustworthy? Psychology and behavioral economics research has found processing fluency (i.e., speed and accuracy of perceiving and processing a stimulus) is central to perceived trust. We examine the association between processing fluency and trust in visualizations through two empirical studies. In Experiment 1, we tested the effect of camouflaging a visualization on processing fluency. Participants estimated the proportion of data values within a specified range for six camouflaged visualizations and one non-camouflaged control; they also reported their perceived difficulty for each of the visualizations. Camouflaged visualizations produced less accurate estimations compared to the control. In Experiment 2, we created a decision task based on trust games adapted from behavioral economics. We asked participants to invest money in two hypothetical companies and report how much they trust each company. One company communicates its strategy with a camouflaged visualization, the other with a controlled visualization. Participants tended to invest less money in the company presenting a camouflaged visualization. Hence, we found support for the hypothesis that processing fluency is key to the perception of trust in visual data communication.",
        "venue": "IEEE TREX, 2022",
        "link": "https://arxiv.org/pdf/2209.14340.pdf",
        "tagType": "workshop-tag"
    },
    {
        "key": "paper3",
        "paperName": "Processing Fluency Improves Trust In Scatterplot Visualizations",
        "img": "/poster_teaser.png",
        "altText": "Top left is an example of visualizations shown to participants of the experiment along with the trust game question. Top right is the same stimulus as the top right but the question is now a subjective trust rating. The bottom of the image is a boxplot for each question showing the distribution of participants answers for the camouflage and control conditions.",
        "authors": "Hamza Elhamdadi, Lace Padilla, Cindy Xiong",
        "abstract": "Trust plays a significant role in how people perceive, discount, or dismiss scientific information and make critical decisions. Therefore, establishing trust is a critical first step in visual data communication. But what makes a visualization trustworthy? Researchers in psychology and behavioral economics have identified processing fluency (i.e., speed and accuracy of perceiving and processing a stimulus) as a key factor impacting trust perception. We examine the association between processing fluency and trust in visualizations through two empirical studies. We manipulated fluency by creating camouflaged visualizations that are more difficult to process. In Experiment 1, we tested the effect of camouflaging a visualization on processing fluency. Participants completed a perceptual task with six camouflaged visualizations and one non-camouflaged control. The task involved estimating the proportion of data values within a range and reporting the difficulty of doing so. We found the camouflaged visualizations produced less accurate estimations compared to the control. In Experiment 2, we created a decision task based on trust games adapted from behavioral economics. We asked participants to invest money in two hypothetical companies and report how much they trust each company. One company communicates its strategy with a camouflaged visualization, the other with a controlled visualization. The results revealed that participants tend to invest less money in the company presenting a camouflaged visualization. We found that processing fluency is a key factor in the perception of trust in visual data communication.",
        "venue": "IEEE VIS Posters, 2022",
        "link": "/visposter2022.pdf",
        "tagType": "poster-tag"
    },
    {
        "key": "paper2",
        "paperName": "AffectiveTDA: Using Topological Data Analysis to Improve Analysis and Explainability in Affective Computing",
        "img": "/affectiveTDA_teaser.png",
        "altText": "Top of the image shows the creation of a persistence diagram by forming simplexes on 2D facial landmarks. The bottom of the image shows output of the topology pipeline for using TSNE and UMAP dimension reduction.",
        "authors": "Hamza Elhamdadi, Shaun Canavan, Paul Rosen",
        "abstract": "We present an approach utilizing Topological Data Analysis to study the structure of face poses used in affective computing, i.e., the process of recognizing human emotion. The approach uses a conditional comparison of different emotions, both respective and irrespective of time, with multiple topological distance metrics, dimension reduction techniques, and face subsections (e.g., eyes, nose, mouth, etc.). The results confirm that our topology-based approach captures known patterns, distinctions between emotions, and distinctions between individuals, which is an important step towards more robust and explainable emotion recognition by machines.",
        "venue": "IEEE VIS, 2021",
        "link": "https://arxiv.org/pdf/2107.08573.pdf",
        "tagType": "conference-tag"
    },
    {
        "key": "paper1",
        "paperName": "Recognizing Emotion in the Wild using Multimodal Data",
        "img": "/multimodal_teaser.png",
        "altText": "Diagram of the Group emotion recognition architecture. The input video is separated into visual and audio features. The visual and audio features are passed through separate Xception networks. The output of the two Xception networks is fused and sent through a fully-connected layer which outputs the class and the negative of the input video.",
        "authors": "Shivam Srivastava, Saandeep Aathreya, Saurabh Hinduja, Sk Rahatul Jannat, Hamza Elhamdadi, and Shaun Canavan",
        "abstract": "In this work, we present our approach for all four tracks of the eighth Emotion Recognition in the Wild Challenge (EmotiW 2020). The four tasks are group emotion recognition, driver gaze prediction, predicting engagement in the wild, and emotion recognition using physiological signals. We explore multiple approaches including classical machine learning tools such as random forests, state of the art deep neural networks, and multiple fusion and ensemblebased approaches. We also show that similar approaches can be used across tracks as many of the features generalize well to the different problems (e.g. facial features). We detail evaluation results that are either comparable to or outperform the baseline results for both the validation and testing for most of the tracks.",
        "venue": "ICMI, 2020",
        "link": "https://dl.acm.org/doi/pdf/10.1145/3382507.3417970",
        "tagType": "conference-tag"
    }
]